// Оператор не (!) чаще всего используется в условных инструкциях
// примеры с оператором !
!10 //false
    !0 //true
    !'abc' //false
    !'' //true
    !true // false
    !undefined //true
    // Полволяет проверить ложность значения

// Оператор &&
// Выражение 1 && Выражение 2
// если Выражение 1 ложное
// 1. Выражение 2 игнорируется
// 2. Возвращается результат Выражение 1

// Оператор ||
// Выражение 1 || Выражение 2
// Если Выражение 1 истинно
// 1. Выражение 2 игнорируется
// 2. Возвращается результат Выражение 1